xml/request/bibliographicSearch.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope"
xmlns:xml="http://www.w3.org/XML/1998/namespace"
xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
xmlns:xs="http://www.w3.org/2001/XMLSchema"
xmlns:ofow="http://oss.dbc.dk/ns/openfindorder_wsdl"
xmlns:ofo="http://oss.dbc.dk/ns/openfindorder"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
<SOAP-ENV:Body>
<ofo:bibliographicSearchRequest>
  <ofo:authentication>
    <ofo:groupIdAut>?</ofo:groupIdAut>
    <ofo:passwordAut>?</ofo:passwordAut>
    <ofo:userIdAut>?</ofo:userIdAut>
  </ofo:authentication>
  <ofo:requesterAgencyId>?</ofo:requesterAgencyId>
  <ofo:responderAgencyId>?</ofo:responderAgencyId>
  <ofo:author>?</ofo:author>
  <ofo:bibliographicFreeText>?</ofo:bibliographicFreeText>
  <ofo:bibliographicRecordId>?</ofo:bibliographicRecordId>
  <ofo:isbn>?</ofo:isbn>
  <ofo:issn>?</ofo:issn>
  <ofo:mediumType>?</ofo:mediumType>
  <ofo:title>?</ofo:title>
  <ofo:agency>?</ofo:agency>
  <ofo:orderSystem>?</ofo:orderSystem>
  <ofo:fromDate>?</ofo:fromDate>
  <ofo:toDate>?</ofo:toDate>
  <ofo:outputType>?</ofo:outputType>
  <ofo:callback>?</ofo:callback>
  <ofo:start>?</ofo:start>
  <ofo:stepValue>?</ofo:stepValue>
</ofo:bibliographicSearchRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>



